[Survived] BooleanLiteral
sandbox/src/smoothers/physics-spring-smoother.ts:47:24
 	private velX = 0;
 	private velY = 0;
 	private lastTs: number | null = null;
-	private initialized = false;
+	private initialized = true;
 
 	constructor(config: SpringDamperConfig) {

[Killed] BlockStatement
sandbox/src/smoothers/physics-spring-smoother.ts:49:42
 	private lastTs: number | null = null;
 	private initialized = false;
 
-	constructor(config: SpringDamperConfig) {
-		this.stiffness = config.stiffness;
-		this.damping = config.damping;
-		this.mass = config.mass;
-	}
+	constructor(config: SpringDamperConfig) {}
 
 	smooth(frame: SensorFrame): SmoothedFrame {
killedBy: PhysicsSpringDamperSmoother smooth() returns valid SmoothedFrame with spring physics
statusReason: [
  {
    "code": "invalid_type",
    "expected": "number",
    "received": "nan",
    "path": [
      "position",
      "x"

[Killed] BooleanLiteral
sandbox/src/smoothers/physics-spring-smoother.ts:57:7
 
 	smooth(frame: SensorFrame): SmoothedFrame {
 		// If no valid tracking, pass through with null position
-		if (!frame.trackingOk || !frame.indexTip) {
+		if (frame.trackingOk || !frame.indexTip) {
 			this.reset();
 			return SmoothedFrameSchema.parse({
killedBy: PhysicsSpringDamperSmoother smooth() returns valid SmoothedFrame with spring physics
statusReason: expected null not to be null

[Killed] BooleanLiteral
sandbox/src/smoothers/physics-spring-smoother.ts:57:28
 
 	smooth(frame: SensorFrame): SmoothedFrame {
 		// If no valid tracking, pass through with null position
-		if (!frame.trackingOk || !frame.indexTip) {
+		if (!frame.trackingOk || frame.indexTip) {
 			this.reset();
 			return SmoothedFrameSchema.parse({
killedBy: PhysicsSpringDamperSmoother smooth() returns valid SmoothedFrame with spring physics
statusReason: expected null not to be null

[NoCoverage] BooleanLiteral
sandbox/src/smoothers/physics-spring-smoother.ts:62:17
 			return SmoothedFrameSchema.parse({
 				ts: frame.ts,
 				handId: frame.handId,
-				trackingOk: false,
+				trackingOk: true,
 				palmFacing: frame.palmFacing,
 				label: frame.label,

[Killed] BooleanLiteral
sandbox/src/smoothers/physics-spring-smoother.ts:76:7
 		const targetY = frame.indexTip.y;
 
 		// Initialize on first frame
-		if (!this.initialized) {
+		if (this.initialized) {
 			this.posX = targetX;
 			this.posY = targetY;
killedBy: SmootherChain (Composable Pipeline) reset() resets all smoothers in chain
statusReason: expected 0.075 to be close to 0.9, received difference is 0.8250000000000001, but expected 0.05

[Killed] ConditionalExpression
sandbox/src/smoothers/physics-spring-smoother.ts:76:7
 		const targetY = frame.indexTip.y;
 
 		// Initialize on first frame
-		if (!this.initialized) {
+		if (false) {
 			this.posX = targetX;
 			this.posY = targetY;
killedBy: SmootherChain (Composable Pipeline) reset() resets all smoothers in chain
statusReason: expected 0.075 to be close to 0.9, received difference is 0.8250000000000001, but expected 0.05

[Survived] BooleanLiteral
sandbox/src/smoothers/physics-spring-smoother.ts:82:23
 			this.velX = 0;
 			this.velY = 0;
 			this.lastTs = frame.ts;
-			this.initialized = true;
+			this.initialized = false;
 		}
 

[Killed] ArithmeticOperator
sandbox/src/smoothers/physics-spring-smoother.ts:86:36
 		}
 
 		// Calculate time delta
-		let dt = this.lastTs !== null ? (frame.ts - this.lastTs) / 1000 : 1 / 60;
+		let dt = this.lastTs !== null ? (frame.ts + this.lastTs) / 1000 : 1 / 60;
 		if (dt <= 0) dt = 1 / 60;
 		this.lastTs = frame.ts;
killedBy: PhysicsSpringDamperSmoother exhibits spring behavior - overshoots then settles
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 0.05

[Killed] ArithmeticOperator
sandbox/src/smoothers/physics-spring-smoother.ts:86:35
 		}
 
 		// Calculate time delta
-		let dt = this.lastTs !== null ? (frame.ts - this.lastTs) / 1000 : 1 / 60;
+		let dt = this.lastTs !== null ? (frame.ts - this.lastTs) * 1000 : 1 / 60;
 		if (dt <= 0) dt = 1 / 60;
 		this.lastTs = frame.ts;
killedBy: PhysicsSpringDamperSmoother exhibits spring behavior - overshoots then settles
statusReason: expected 1 to be close to 0.8, received difference is 0.19999999999999996, but expected 0.05

[Survived] ConditionalExpression
sandbox/src/smoothers/physics-spring-smoother.ts:87:7
 
 		// Calculate time delta
 		let dt = this.lastTs !== null ? (frame.ts - this.lastTs) / 1000 : 1 / 60;
-		if (dt <= 0) dt = 1 / 60;
+		if (true) dt = 1 / 60;
 		this.lastTs = frame.ts;
 

[Survived] EqualityOperator
sandbox/src/smoothers/physics-spring-smoother.ts:87:7
 
 		// Calculate time delta
 		let dt = this.lastTs !== null ? (frame.ts - this.lastTs) / 1000 : 1 / 60;
-		if (dt <= 0) dt = 1 / 60;
+		if (dt > 0) dt = 1 / 60;
 		this.lastTs = frame.ts;
 

[Killed] UnaryOperator
sandbox/src/smoothers/physics-spring-smoother.ts:96:18
 		// x += v * dt
 
 		// X axis
-		const forceX = -this.stiffness * (this.posX - targetX) - this.damping * this.velX;
+		const forceX = +this.stiffness * (this.posX - targetX) - this.damping * this.velX;
 		const accelX = forceX / this.mass;
 		this.velX += accelX * dt;
killedBy: PhysicsSpringDamperSmoother exhibits spring behavior - overshoots then settles
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 0.05

[Killed] ArithmeticOperator
sandbox/src/smoothers/physics-spring-smoother.ts:96:37
 		// x += v * dt
 
 		// X axis
-		const forceX = -this.stiffness * (this.posX - targetX) - this.damping * this.velX;
+		const forceX = -this.stiffness * (this.posX + targetX) - this.damping * this.velX;
 		const accelX = forceX / this.mass;
 		this.velX += accelX * dt;
killedBy: PhysicsSpringDamperSmoother exhibits spring behavior - overshoots then settles
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 0.05

[Survived] ArithmeticOperator
sandbox/src/smoothers/physics-spring-smoother.ts:97:18
 
 		// X axis
 		const forceX = -this.stiffness * (this.posX - targetX) - this.damping * this.velX;
-		const accelX = forceX / this.mass;
+		const accelX = forceX * this.mass;
 		this.velX += accelX * dt;
 		this.posX += this.velX * dt;

[Killed] ArithmeticOperator
sandbox/src/smoothers/physics-spring-smoother.ts:98:16
 		// X axis
 		const forceX = -this.stiffness * (this.posX - targetX) - this.damping * this.velX;
 		const accelX = forceX / this.mass;
-		this.velX += accelX * dt;
+		this.velX += accelX / dt;
 		this.posX += this.velX * dt;
 
killedBy: PhysicsSpringDamperSmoother exhibits spring behavior - overshoots then settles
statusReason: expected 1 to be close to 0.8, received difference is 0.19999999999999996, but expected 0.05

[Killed] AssignmentOperator
sandbox/src/smoothers/physics-spring-smoother.ts:98:3
 		// X axis
 		const forceX = -this.stiffness * (this.posX - targetX) - this.damping * this.velX;
 		const accelX = forceX / this.mass;
-		this.velX += accelX * dt;
+		this.velX -= accelX * dt;
 		this.posX += this.velX * dt;
 
killedBy: PhysicsSpringDamperSmoother exhibits spring behavior - overshoots then settles
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 0.05

[Killed] ArithmeticOperator
sandbox/src/smoothers/physics-spring-smoother.ts:99:16
 		const forceX = -this.stiffness * (this.posX - targetX) - this.damping * this.velX;
 		const accelX = forceX / this.mass;
 		this.velX += accelX * dt;
-		this.posX += this.velX * dt;
+		this.posX += this.velX / dt;
 
 		// Y axis
killedBy: PhysicsSpringDamperSmoother exhibits spring behavior - overshoots then settles
statusReason: expected 1 to be close to 0.8, received difference is 0.19999999999999996, but expected 0.05

[Killed] AssignmentOperator
sandbox/src/smoothers/physics-spring-smoother.ts:99:3
 		const forceX = -this.stiffness * (this.posX - targetX) - this.damping * this.velX;
 		const accelX = forceX / this.mass;
 		this.velX += accelX * dt;
-		this.posX += this.velX * dt;
+		this.posX -= this.velX * dt;
 
 		// Y axis
killedBy: PhysicsSpringDamperSmoother exhibits spring behavior - overshoots then settles
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 0.05

[Killed] ArithmeticOperator
sandbox/src/smoothers/physics-spring-smoother.ts:102:18
 		this.posX += this.velX * dt;
 
 		// Y axis
-		const forceY = -this.stiffness * (this.posY - targetY) - this.damping * this.velY;
+		const forceY = -this.stiffness / (this.posY - targetY) - this.damping * this.velY;
 		const accelY = forceY / this.mass;
 		this.velY += accelY * dt;
killedBy: PhysicsSpringDamperSmoother exhibits spring behavior - overshoots then settles
statusReason: [
  {
    "code": "invalid_type",
    "expected": "number",
    "received": "nan",
    "path": [
      "position",
      "y"

[Survived] ArithmeticOperator
sandbox/src/smoothers/physics-spring-smoother.ts:102:60
 		this.posX += this.velX * dt;
 
 		// Y axis
-		const forceY = -this.stiffness * (this.posY - targetY) - this.damping * this.velY;
+		const forceY = -this.stiffness * (this.posY - targetY) - this.damping / this.velY;
 		const accelY = forceY / this.mass;
 		this.velY += accelY * dt;

[Survived] ArithmeticOperator
sandbox/src/smoothers/physics-spring-smoother.ts:103:18
 
 		// Y axis
 		const forceY = -this.stiffness * (this.posY - targetY) - this.damping * this.velY;
-		const accelY = forceY / this.mass;
+		const accelY = forceY * this.mass;
 		this.velY += accelY * dt;
 		this.posY += this.velY * dt;

[Survived] AssignmentOperator
sandbox/src/smoothers/physics-spring-smoother.ts:104:3
 		// Y axis
 		const forceY = -this.stiffness * (this.posY - targetY) - this.damping * this.velY;
 		const accelY = forceY / this.mass;
-		this.velY += accelY * dt;
+		this.velY -= accelY * dt;
 		this.posY += this.velY * dt;
 

[Survived] ArithmeticOperator
sandbox/src/smoothers/physics-spring-smoother.ts:104:16
 		// Y axis
 		const forceY = -this.stiffness * (this.posY - targetY) - this.damping * this.velY;
 		const accelY = forceY / this.mass;
-		this.velY += accelY * dt;
+		this.velY += accelY / dt;
 		this.posY += this.velY * dt;
 

[Survived] ArithmeticOperator
sandbox/src/smoothers/physics-spring-smoother.ts:105:16
 		const forceY = -this.stiffness * (this.posY - targetY) - this.damping * this.velY;
 		const accelY = forceY / this.mass;
 		this.velY += accelY * dt;
-		this.posY += this.velY * dt;
+		this.posY += this.velY / dt;
 
 		// Clamp to [0,1] range

[Survived] AssignmentOperator
sandbox/src/smoothers/physics-spring-smoother.ts:105:3
 		const forceY = -this.stiffness * (this.posY - targetY) - this.damping * this.velY;
 		const accelY = forceY / this.mass;
 		this.velY += accelY * dt;
-		this.posY += this.velY * dt;
+		this.posY -= this.velY * dt;
 
 		// Clamp to [0,1] range

[Killed] MethodExpression
sandbox/src/smoothers/physics-spring-smoother.ts:108:15
 		this.posY += this.velY * dt;
 
 		// Clamp to [0,1] range
-		this.posX = Math.max(0, Math.min(1, this.posX));
+		this.posX = Math.min(0, Math.min(1, this.posX));
 		this.posY = Math.max(0, Math.min(1, this.posY));
 
killedBy: PhysicsSpringDamperSmoother exhibits spring behavior - overshoots then settles
statusReason: expected +0 to be close to 0.8, received difference is 0.8, but expected 0.05

[Killed] MethodExpression
sandbox/src/smoothers/physics-spring-smoother.ts:108:27
 		this.posY += this.velY * dt;
 
 		// Clamp to [0,1] range
-		this.posX = Math.max(0, Math.min(1, this.posX));
+		this.posX = Math.max(0, Math.max(1, this.posX));
 		this.posY = Math.max(0, Math.min(1, this.posY));
 
killedBy: PhysicsSpringDamperSmoother exhibits spring behavior - overshoots then settles
statusReason: expected 1 to be close to 0.8, received difference is 0.19999999999999996, but expected 0.05

[Survived] MethodExpression
sandbox/src/smoothers/physics-spring-smoother.ts:109:27
 
 		// Clamp to [0,1] range
 		this.posX = Math.max(0, Math.min(1, this.posX));
-		this.posY = Math.max(0, Math.min(1, this.posY));
+		this.posY = Math.max(0, Math.max(1, this.posY));
 
 		// Predict one frame ahead

[Survived] MethodExpression
sandbox/src/smoothers/physics-spring-smoother.ts:109:15
 
 		// Clamp to [0,1] range
 		this.posX = Math.max(0, Math.min(1, this.posX));
-		this.posY = Math.max(0, Math.min(1, this.posY));
+		this.posY = Math.min(0, Math.min(1, this.posY));
 
 		// Predict one frame ahead

[Survived] MethodExpression
sandbox/src/smoothers/physics-spring-smoother.ts:112:17
 		this.posY = Math.max(0, Math.min(1, this.posY));
 
 		// Predict one frame ahead
-		const predX = Math.max(0, Math.min(1, this.posX + this.velX * (1 / 60)));
+		const predX = Math.min(0, Math.min(1, this.posX + this.velX * (1 / 60)));
 		const predY = Math.max(0, Math.min(1, this.posY + this.velY * (1 / 60)));
 

[Survived] ArithmeticOperator
sandbox/src/smoothers/physics-spring-smoother.ts:112:41
 		this.posY = Math.max(0, Math.min(1, this.posY));
 
 		// Predict one frame ahead
-		const predX = Math.max(0, Math.min(1, this.posX + this.velX * (1 / 60)));
+		const predX = Math.max(0, Math.min(1, this.posX - this.velX * (1 / 60)));
 		const predY = Math.max(0, Math.min(1, this.posY + this.velY * (1 / 60)));
 

[Survived] MethodExpression
sandbox/src/smoothers/physics-spring-smoother.ts:113:29
 
 		// Predict one frame ahead
 		const predX = Math.max(0, Math.min(1, this.posX + this.velX * (1 / 60)));
-		const predY = Math.max(0, Math.min(1, this.posY + this.velY * (1 / 60)));
+		const predY = Math.max(0, Math.max(1, this.posY + this.velY * (1 / 60)));
 
 		return SmoothedFrameSchema.parse({

[Survived] ArithmeticOperator
sandbox/src/smoothers/physics-spring-smoother.ts:113:66
 
 		// Predict one frame ahead
 		const predX = Math.max(0, Math.min(1, this.posX + this.velX * (1 / 60)));
-		const predY = Math.max(0, Math.min(1, this.posY + this.velY * (1 / 60)));
+		const predY = Math.max(0, Math.min(1, this.posY + this.velY * (1 * 60)));
 
 		return SmoothedFrameSchema.parse({

[Survived] BooleanLiteral
sandbox/src/smoothers/physics-spring-smoother.ts:118:16
 		return SmoothedFrameSchema.parse({
 			ts: frame.ts,
 			handId: frame.handId,
-			trackingOk: true,
+			trackingOk: false,
 			palmFacing: frame.palmFacing,
 			label: frame.label,

[Killed] ObjectLiteral
sandbox/src/smoothers/physics-spring-smoother.ts:122:14
 			palmFacing: frame.palmFacing,
 			label: frame.label,
 			confidence: frame.confidence,
-			position: { x: this.posX, y: this.posY },
+			position: {},
 			velocity: { x: this.velX, y: this.velY },
 			prediction: { x: predX, y: predY },
killedBy: PhysicsSpringDamperSmoother smooth() returns valid SmoothedFrame with spring physics
statusReason: [
  {
    "code": "invalid_type",
    "expected": "number",
    "received": "undefined",
    "path": [
      "position",
      "x"

[Killed] ObjectLiteral
sandbox/src/smoothers/physics-spring-smoother.ts:123:14
 			label: frame.label,
 			confidence: frame.confidence,
 			position: { x: this.posX, y: this.posY },
-			velocity: { x: this.velX, y: this.velY },
+			velocity: {},
 			prediction: { x: predX, y: predY },
 		});
killedBy: PhysicsSpringDamperSmoother smooth() returns valid SmoothedFrame with spring physics
statusReason: [
  {
    "code": "invalid_type",
    "expected": "number",
    "received": "undefined",
    "path": [
      "velocity",
      "x"

[Killed] BlockStatement
sandbox/src/smoothers/physics-spring-smoother.ts:128:16
 		});
 	}
 
-	reset(): void {
-		this.posX = 0;
-		this.posY = 0;
-		this.velX = 0;
-		this.velY = 0;
-		this.lastTs = null;
-		this.initialized = false;
-	}
+	reset(): void {}
 
 	setParams(params: Partial<SpringDamperConfig>): void {
killedBy: SmootherChain (Composable Pipeline) reset() resets all smoothers in chain
statusReason: expected 1 to be close to 0.9, received difference is 0.09999999999999998, but expected 0.05

[Killed] BooleanLiteral
sandbox/src/smoothers/physics-spring-smoother.ts:134:22
 		this.velX = 0;
 		this.velY = 0;
 		this.lastTs = null;
-		this.initialized = false;
+		this.initialized = true;
 	}
 
killedBy: SmootherChain (Composable Pipeline) reset() resets all smoothers in chain
statusReason: expected 0.075 to be close to 0.9, received difference is 0.8250000000000001, but expected 0.05

[NoCoverage] BlockStatement
sandbox/src/smoothers/physics-spring-smoother.ts:137:55
 		this.initialized = false;
 	}
 
-	setParams(params: Partial<SpringDamperConfig>): void {
-		if (params.stiffness !== undefined) this.stiffness = params.stiffness;
-		if (params.damping !== undefined) this.damping = params.damping;
-		if (params.mass !== undefined) this.mass = params.mass;
-	}
+	setParams(params: Partial<SpringDamperConfig>): void {}
 }
 

[NoCoverage] ConditionalExpression
sandbox/src/smoothers/physics-spring-smoother.ts:138:7
 	}
 
 	setParams(params: Partial<SpringDamperConfig>): void {
-		if (params.stiffness !== undefined) this.stiffness = params.stiffness;
+		if (true) this.stiffness = params.stiffness;
 		if (params.damping !== undefined) this.damping = params.damping;
 		if (params.mass !== undefined) this.mass = params.mass;

[NoCoverage] EqualityOperator
sandbox/src/smoothers/physics-spring-smoother.ts:138:7
 	}
 
 	setParams(params: Partial<SpringDamperConfig>): void {
-		if (params.stiffness !== undefined) this.stiffness = params.stiffness;
+		if (params.stiffness === undefined) this.stiffness = params.stiffness;
 		if (params.damping !== undefined) this.damping = params.damping;
 		if (params.mass !== undefined) this.mass = params.mass;

[NoCoverage] ConditionalExpression
sandbox/src/smoothers/physics-spring-smoother.ts:139:7
 
 	setParams(params: Partial<SpringDamperConfig>): void {
 		if (params.stiffness !== undefined) this.stiffness = params.stiffness;
-		if (params.damping !== undefined) this.damping = params.damping;
+		if (false) this.damping = params.damping;
 		if (params.mass !== undefined) this.mass = params.mass;
 	}

[NoCoverage] EqualityOperator
sandbox/src/smoothers/physics-spring-smoother.ts:139:7
 
 	setParams(params: Partial<SpringDamperConfig>): void {
 		if (params.stiffness !== undefined) this.stiffness = params.stiffness;
-		if (params.damping !== undefined) this.damping = params.damping;
+		if (params.damping === undefined) this.damping = params.damping;
 		if (params.mass !== undefined) this.mass = params.mass;
 	}

[NoCoverage] ConditionalExpression
sandbox/src/smoothers/physics-spring-smoother.ts:140:7
 	setParams(params: Partial<SpringDamperConfig>): void {
 		if (params.stiffness !== undefined) this.stiffness = params.stiffness;
 		if (params.damping !== undefined) this.damping = params.damping;
-		if (params.mass !== undefined) this.mass = params.mass;
+		if (false) this.mass = params.mass;
 	}
 }

[NoCoverage] EqualityOperator
sandbox/src/smoothers/physics-spring-smoother.ts:140:7
 	setParams(params: Partial<SpringDamperConfig>): void {
 		if (params.stiffness !== undefined) this.stiffness = params.stiffness;
 		if (params.damping !== undefined) this.damping = params.damping;
-		if (params.mass !== undefined) this.mass = params.mass;
+		if (params.mass === undefined) this.mass = params.mass;
 	}
 }
