[Killed] Regex
bronze/src/contracts/vacuole-envelope.ts:27:9
  */
 export const TraceparentSchema = z
 	.string()
-	.regex(/^00-[0-9a-f]{32}-[0-9a-f]{16}-[0-9a-f]{2}$/, 'Invalid W3C traceparent format');
+	.regex(/^00-[0-9a-f]{32}-[0-9a-f]{16}-[0-9a-f]{2}/, 'Invalid W3C traceparent format');
 export type Traceparent = z.infer<typeof TraceparentSchema>;
 
killedBy: TraceparentSchema - W3C Compliance Invalid traceparents should reject suffix after valid traceparent ($ anchor)
statusReason: expected [Function] to throw an error

[Killed] Regex
bronze/src/contracts/vacuole-envelope.ts:27:9
  */
 export const TraceparentSchema = z
 	.string()
-	.regex(/^00-[0-9a-f]{32}-[0-9a-f]{16}-[0-9a-f]{2}$/, 'Invalid W3C traceparent format');
+	.regex(/^00-[0-9a-f]{32}-[0-9a-f]{16}-[^0-9a-f]{2}$/, 'Invalid W3C traceparent format');
 export type Traceparent = z.infer<typeof TraceparentSchema>;
 
killedBy: TraceparentSchema - W3C Compliance Valid traceparents should accept valid W3C traceparent format
statusReason: expected [Function] to not throw an error but '[\n  {\n    "validation": "regex",\n …' was thrown

[Killed] BlockStatement
bronze/src/contracts/vacuole-envelope.ts:33:52
 /**
  * Generate a new W3C traceparent
  */
-export function generateTraceparent(): Traceparent {
-	const traceId = Array.from({ length: 32 }, () => Math.floor(Math.random() * 16).toString(16)).join('');
-	const parentId = Array.from({ length: 16 }, () => Math.floor(Math.random() * 16).toString(16)).join('');
-	return `00-${traceId}-${parentId}-01` as Traceparent;
-}
+export function generateTraceparent(): Traceparent {}
 
 /**
killedBy: TraceparentSchema - W3C Compliance Valid traceparents should generate valid traceparent via generateTraceparent()
statusReason: Property failed after 1 tests
{ seed: 1890356697, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)
Got AssertionError: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
bronze/src/contracts/vacuole-envelope.ts:34:62
  * Generate a new W3C traceparent
  */
 export function generateTraceparent(): Traceparent {
-	const traceId = Array.from({ length: 32 }, () => Math.floor(Math.random() * 16).toString(16)).join('');
+	const traceId = Array.from({ length: 32 }, () => Math.floor(Math.random() / 16).toString(16)).join('');
 	const parentId = Array.from({ length: 16 }, () => Math.floor(Math.random() * 16).toString(16)).join('');
 	return `00-${traceId}-${parentId}-01` as Traceparent;
killedBy: TraceparentSchema - W3C Compliance Valid traceparents generateTraceparent() produces unique trace-ids
statusReason: expected 1 to be greater than 90

[Killed] ArrowFunction
bronze/src/contracts/vacuole-envelope.ts:34:45
  * Generate a new W3C traceparent
  */
 export function generateTraceparent(): Traceparent {
-	const traceId = Array.from({ length: 32 }, () => Math.floor(Math.random() * 16).toString(16)).join('');
+	const traceId = Array.from({ length: 32 }, () => undefined).join('');
 	const parentId = Array.from({ length: 16 }, () => Math.floor(Math.random() * 16).toString(16)).join('');
 	return `00-${traceId}-${parentId}-01` as Traceparent;
killedBy: TraceparentSchema - W3C Compliance Valid traceparents should generate valid traceparent via generateTraceparent()
statusReason: Property failed after 1 tests
{ seed: -1177546180, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)
Got AssertionError: expected false to be true // Object.is equality

[Killed] ArrowFunction
bronze/src/contracts/vacuole-envelope.ts:35:46
  */
 export function generateTraceparent(): Traceparent {
 	const traceId = Array.from({ length: 32 }, () => Math.floor(Math.random() * 16).toString(16)).join('');
-	const parentId = Array.from({ length: 16 }, () => Math.floor(Math.random() * 16).toString(16)).join('');
+	const parentId = Array.from({ length: 16 }, () => undefined).join('');
 	return `00-${traceId}-${parentId}-01` as Traceparent;
 }
killedBy: TraceparentSchema - W3C Compliance Valid traceparents should generate valid traceparent via generateTraceparent()
statusReason: Property failed after 1 tests
{ seed: 706123662, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)
Got AssertionError: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
bronze/src/contracts/vacuole-envelope.ts:35:63
  */
 export function generateTraceparent(): Traceparent {
 	const traceId = Array.from({ length: 32 }, () => Math.floor(Math.random() * 16).toString(16)).join('');
-	const parentId = Array.from({ length: 16 }, () => Math.floor(Math.random() * 16).toString(16)).join('');
+	const parentId = Array.from({ length: 16 }, () => Math.floor(Math.random() / 16).toString(16)).join('');
 	return `00-${traceId}-${parentId}-01` as Traceparent;
 }

[Killed] BlockStatement
bronze/src/contracts/vacuole-envelope.ts:42:72
 /**
  * Propagate trace context (creates child span)
  */
-export function propagateTraceparent(parent: Traceparent): Traceparent {
-	const [version, traceId, _parentId, flags] = parent.split('-');
-	const newParentId = Array.from({ length: 16 }, () => Math.floor(Math.random() * 16).toString(16)).join('');
-	return `${version}-${traceId}-${newParentId}-${flags}` as Traceparent;
-}
+export function propagateTraceparent(parent: Traceparent): Traceparent {}
 
 // ============================================================================
killedBy: TraceparentSchema - W3C Compliance propagateTraceparent - Trace continuity should preserve trace-id across propagation
statusReason: Property failed after 1 tests
{ seed: 1940246789, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)
Got TypeError: Cannot read properties of undefined (reading 'split')

[Killed] StringLiteral
bronze/src/contracts/vacuole-envelope.ts:43:60
  * Propagate trace context (creates child span)
  */
 export function propagateTraceparent(parent: Traceparent): Traceparent {
-	const [version, traceId, _parentId, flags] = parent.split('-');
+	const [version, traceId, _parentId, flags] = parent.split("");
 	const newParentId = Array.from({ length: 16 }, () => Math.floor(Math.random() * 16).toString(16)).join('');
 	return `${version}-${traceId}-${newParentId}-${flags}` as Traceparent;
killedBy: TraceparentSchema - W3C Compliance propagateTraceparent - Trace continuity should preserve trace-id across propagation
statusReason: Property failed after 1 tests
{ seed: 1273108263, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)
Got AssertionError: expected '0' to be '00' // Object.is equality

[Killed] ArrowFunction
bronze/src/contracts/vacuole-envelope.ts:44:49
  */
 export function propagateTraceparent(parent: Traceparent): Traceparent {
 	const [version, traceId, _parentId, flags] = parent.split('-');
-	const newParentId = Array.from({ length: 16 }, () => Math.floor(Math.random() * 16).toString(16)).join('');
+	const newParentId = Array.from({ length: 16 }, () => undefined).join('');
 	return `${version}-${traceId}-${newParentId}-${flags}` as Traceparent;
 }
killedBy: TraceparentSchema - W3C Compliance propagateTraceparent - Trace continuity should generate new parent-id for each propagation
statusReason: expected 1 to be greater than 90

[Killed] ArithmeticOperator
bronze/src/contracts/vacuole-envelope.ts:44:66
  */
 export function propagateTraceparent(parent: Traceparent): Traceparent {
 	const [version, traceId, _parentId, flags] = parent.split('-');
-	const newParentId = Array.from({ length: 16 }, () => Math.floor(Math.random() * 16).toString(16)).join('');
+	const newParentId = Array.from({ length: 16 }, () => Math.floor(Math.random() / 16).toString(16)).join('');
 	return `${version}-${traceId}-${newParentId}-${flags}` as Traceparent;
 }
killedBy: TraceparentSchema - W3C Compliance propagateTraceparent - Trace continuity should generate new parent-id for each propagation
statusReason: expected 1 to be greater than 90

[Killed] ObjectLiteral
bronze/src/contracts/vacuole-envelope.ts:56:47
 /**
  * CloudEvents 1.0 base envelope (required fields)
  */
-export const CloudEventsBaseSchema = z.object({
-	// REQUIRED by CloudEvents 1.0
-	specversion: z.literal('1.0'),
-	id: z.string().uuid(),
-	source: z.string().url().or(z.string().startsWith('/hfo/')),
-	type: z.string().min(1),
-
-	// OPTIONAL but recommended
-	time: z.string().datetime().optional(),
-	subject: z.string().optional(),
-	datacontenttype: z.literal('application/json').optional(),
-});
+export const CloudEventsBaseSchema = z.object({});
 
 // ============================================================================
killedBy: CloudEventsBaseSchema - CloudEvents 1.0 Compliance Required fields should reject missing specversion
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
bronze/src/contracts/vacuole-envelope.ts:60:30
 	// REQUIRED by CloudEvents 1.0
 	specversion: z.literal('1.0'),
 	id: z.string().uuid(),
-	source: z.string().url().or(z.string().startsWith('/hfo/')),
+	source: z.string().url().or(z.string().endsWith('/hfo/')),
 	type: z.string().min(1),
 
killedBy: CloudEventsBaseSchema - CloudEvents 1.0 Compliance Required fields should accept valid CloudEvents base
statusReason: expected [Function] to not throw an error but '[\n  {\n    "validation": "url",\n   …' was thrown

[Killed] MethodExpression
bronze/src/contracts/vacuole-envelope.ts:61:8
 	specversion: z.literal('1.0'),
 	id: z.string().uuid(),
 	source: z.string().url().or(z.string().startsWith('/hfo/')),
-	type: z.string().min(1),
+	type: z.string().max(1),
 
 	// OPTIONAL but recommended
killedBy: CloudEventsBaseSchema - CloudEvents 1.0 Compliance Required fields should accept valid CloudEvents base
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "too_big",\n    "…' was thrown

[Killed] MethodExpression
bronze/src/contracts/vacuole-envelope.ts:79:10
  */
 export const HFOExtensionsSchema = z.object({
 	/** HFO Generation number (85+) */
-	hfogen: z.number().int().min(85),
+	hfogen: z.number().int().max(85),
 
 	/** HIVE phase: H(unt), I(nterlock), V(alidate), E(volve), X(exception) */
killedBy: HFOExtensionsSchema Required fields should accept valid HFO extensions
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "too_big",\n    "…' was thrown

[Killed] StringLiteral
bronze/src/contracts/vacuole-envelope.ts:82:34
 	hfogen: z.number().int().min(85),
 
 	/** HIVE phase: H(unt), I(nterlock), V(alidate), E(volve), X(exception) */
-	hfohive: z.enum(['H', 'I', 'V', 'E', 'X']),
+	hfohive: z.enum(['H', 'I', 'V', "", 'X']),
 
 	/** Port number (0-7) */
killedBy: HFOExtensionsSchema Required fields should reject invalid hive phase
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
bronze/src/contracts/vacuole-envelope.ts:82:19
 	hfogen: z.number().int().min(85),
 
 	/** HIVE phase: H(unt), I(nterlock), V(alidate), E(volve), X(exception) */
-	hfohive: z.enum(['H', 'I', 'V', 'E', 'X']),
+	hfohive: z.enum(["", 'I', 'V', 'E', 'X']),
 
 	/** Port number (0-7) */
killedBy: HFOExtensionsSchema Required fields should reject invalid hive phase
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
bronze/src/contracts/vacuole-envelope.ts:85:11
 	hfohive: z.enum(['H', 'I', 'V', 'E', 'X']),
 
 	/** Port number (0-7) */
-	hfoport: z.number().int().min(0).max(7),
+	hfoport: z.number().int().min(0).min(7),
 
 	/** Pipeline stage (1-7) for W3C gesture pipeline */
killedBy: HFOExtensionsSchema Required fields should accept valid HFO extensions
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "too_small",\n   …' was thrown

[Killed] MethodExpression
bronze/src/contracts/vacuole-envelope.ts:85:11
 	hfohive: z.enum(['H', 'I', 'V', 'E', 'X']),
 
 	/** Port number (0-7) */
-	hfoport: z.number().int().min(0).max(7),
+	hfoport: z.number().int().max(0).max(7),
 
 	/** Pipeline stage (1-7) for W3C gesture pipeline */
killedBy: HFOExtensionsSchema Required fields should accept valid HFO extensions
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "too_big",\n    "…' was thrown

[Killed] MethodExpression
bronze/src/contracts/vacuole-envelope.ts:88:12
 	hfoport: z.number().int().min(0).max(7),
 
 	/** Pipeline stage (1-7) for W3C gesture pipeline */
-	hfostage: z.number().int().min(1).max(7).optional(),
+	hfostage: z.number().int().min(1).min(7).optional(),
 
 	/** Mark (confidence/priority) 0.0-1.0 */
killedBy: HFOExtensionsSchema Optional fields constraints should accept hfostage 1-7
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "too_small",\n   …' was thrown

[Killed] MethodExpression
bronze/src/contracts/vacuole-envelope.ts:88:12
 	hfoport: z.number().int().min(0).max(7),
 
 	/** Pipeline stage (1-7) for W3C gesture pipeline */
-	hfostage: z.number().int().min(1).max(7).optional(),
+	hfostage: z.number().int().max(1).max(7).optional(),
 
 	/** Mark (confidence/priority) 0.0-1.0 */
killedBy: HFOExtensionsSchema Optional fields constraints should accept hfostage 1-7
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "too_big",\n    "…' was thrown

[Killed] MethodExpression
bronze/src/contracts/vacuole-envelope.ts:91:11
 	hfostage: z.number().int().min(1).max(7).optional(),
 
 	/** Mark (confidence/priority) 0.0-1.0 */
-	hfomark: z.number().min(0).max(1).optional(),
+	hfomark: z.number().min(0).min(1).optional(),
 
 	/** Pull direction for stigmergy */
killedBy: HFOExtensionsSchema Optional fields constraints should accept hfomark 0-1
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "too_small",\n   …' was thrown

[Killed] MethodExpression
bronze/src/contracts/vacuole-envelope.ts:91:11
 	hfostage: z.number().int().min(1).max(7).optional(),
 
 	/** Mark (confidence/priority) 0.0-1.0 */
-	hfomark: z.number().min(0).max(1).optional(),
+	hfomark: z.number().max(0).max(1).optional(),
 
 	/** Pull direction for stigmergy */
killedBy: HFOExtensionsSchema Optional fields constraints should accept hfomark 0-1
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "too_big",\n    "…' was thrown

[Killed] ArrayDeclaration
bronze/src/contracts/vacuole-envelope.ts:94:18
 	hfomark: z.number().min(0).max(1).optional(),
 
 	/** Pull direction for stigmergy */
-	hfopull: z.enum(['upstream', 'downstream', 'lateral']).optional(),
+	hfopull: z.enum([]).optional(),
 
 	/** NATS subject for routing */
killedBy: HFOExtensionsSchema Optional fields constraints should accept valid hfopull directions
statusReason: expected [Function] to not throw an error but '[\n  {\n    "received": "upstream",\n…' was thrown

[Killed] ArrowFunction
bronze/src/contracts/vacuole-envelope.ts:119:38
  * });
  * ```
  */
-export const VacuoleEnvelopeSchema = <T extends z.ZodTypeAny>(dataSchema: T) =>
-	CloudEventsBaseSchema.extend({
-		// W3C Trace Context
-		traceparent: TraceparentSchema,
-		tracestate: z.string().optional(),
-
-		// HFO Extensions
-		...HFOExtensionsSchema.shape,
-
-		// Payload
-		data: dataSchema,
-	});
+export const VacuoleEnvelopeSchema = () => undefined;
 
 /**
killedBy: VacuoleEnvelope - Full Integration VacuoleEnvelopeSchema - Direct parsing should parse valid envelope with data
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ObjectLiteral
bronze/src/contracts/vacuole-envelope.ts:120:31
  * ```
  */
 export const VacuoleEnvelopeSchema = <T extends z.ZodTypeAny>(dataSchema: T) =>
-	CloudEventsBaseSchema.extend({
-		// W3C Trace Context
-		traceparent: TraceparentSchema,
-		tracestate: z.string().optional(),
-
-		// HFO Extensions
-		...HFOExtensionsSchema.shape,
-
-		// Payload
-		data: dataSchema,
-	});
+	CloudEventsBaseSchema.extend({});
 
 /**
killedBy: VacuoleEnvelope - Full Integration VacuoleEnvelopeSchema - Direct parsing should parse valid envelope with data
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] StringLiteral
bronze/src/contracts/vacuole-envelope.ts:189:16
 
 	return {
 		// CloudEvents required
-		specversion: '1.0',
+		specversion: "",
 		id: crypto.randomUUID(),
 		source: `/hfo/gen${options.hfogen}/port${options.hfoport}`,
killedBy: VacuoleEnvelope - Full Integration wrapInVacuole should wrap data in valid CloudEvents envelope
statusReason: expected '' to be '1.0' // Object.is equality

[Killed] StringLiteral
bronze/src/contracts/vacuole-envelope.ts:191:11
 		// CloudEvents required
 		specversion: '1.0',
 		id: crypto.randomUUID(),
-		source: `/hfo/gen${options.hfogen}/port${options.hfoport}`,
+		source: ``,
 		type: options.type,
 
killedBy: VacuoleEnvelope - Full Integration wrapInVacuole should wrap data in valid CloudEvents envelope
statusReason: expected '' to contain '/hfo/'

[Survived] LogicalOperator
bronze/src/contracts/vacuole-envelope.ts:206:12
 		hfohive: options.hfohive,
 		hfoport: options.hfoport,
 		hfostage: options.hfostage,
-		hfomark: options.hfomark ?? 1.0,
+		hfomark: options.hfomark && 1.0,
 		hfopull: options.hfopull ?? 'downstream',
 		hfonats: options.hfonats,

[Killed] LogicalOperator
bronze/src/contracts/vacuole-envelope.ts:207:12
 		hfoport: options.hfoport,
 		hfostage: options.hfostage,
 		hfomark: options.hfomark ?? 1.0,
-		hfopull: options.hfopull ?? 'downstream',
+		hfopull: options.hfopull && 'downstream',
 		hfonats: options.hfonats,
 
killedBy: wrapInVacuole - Default values validation should default hfopull to "downstream" not empty string - kills hfopull mutation
statusReason: expected undefined to be 'downstream' // Object.is equality

[NoCoverage] BlockStatement
bronze/src/contracts/vacuole-envelope.ts:218:67
 /**
  * Unwrap a Vacuole Envelope to get the payload
  */
-export function unwrapVacuole<T>(envelope: VacuoleEnvelope<T>): T {
-	return envelope.data;
-}
+export function unwrapVacuole<T>(envelope: VacuoleEnvelope<T>): T {}
 
 /**

[Killed] BlockStatement
bronze/src/contracts/vacuole-envelope.ts:230:23
 	newData: U,
 	newStage: number,
 	newPort: number
-): VacuoleEnvelope<U> {
-	return wrapInVacuole(newData, {
-		type: source.type.replace(/stage\d/, `stage${newStage}`),
-		hfogen: source.hfogen,
-		hfohive: source.hfohive,
-		hfoport: newPort,
-		hfostage: newStage,
-		parentTrace: source.traceparent,
-		hfonats: source.hfonats,
-		hfomark: source.hfomark,
-		hfopull: source.hfopull,
-	});
-}
+): VacuoleEnvelope<U> {}
 
 // ============================================================================
killedBy: VacuoleEnvelope - Full Integration propagateVacuole should preserve trace-id across envelope propagation
statusReason: Cannot read properties of undefined (reading 'traceparent')

[Killed] Regex
bronze/src/contracts/vacuole-envelope.ts:232:29
 	newPort: number
 ): VacuoleEnvelope<U> {
 	return wrapInVacuole(newData, {
-		type: source.type.replace(/stage\d/, `stage${newStage}`),
+		type: source.type.replace(/stage\D/, `stage${newStage}`),
 		hfogen: source.hfogen,
 		hfohive: source.hfohive,
killedBy: propagateVacuole - Stage Transition Mutations should correctly replace stage NUMBER with new stage number - kills \d → \D mutant
statusReason: expected 'hfo.w3c.gesture.stage1.sense' to be 'hfo.w3c.gesture.stage2.sense' // Object.is equality

[Killed] StringLiteral
bronze/src/contracts/vacuole-envelope.ts:232:40
 	newPort: number
 ): VacuoleEnvelope<U> {
 	return wrapInVacuole(newData, {
-		type: source.type.replace(/stage\d/, `stage${newStage}`),
+		type: source.type.replace(/stage\d/, ``),
 		hfogen: source.hfogen,
 		hfohive: source.hfohive,
killedBy: propagateVacuole - Stage Transition Mutations should correctly replace stage NUMBER with new stage number - kills \d → \D mutant
statusReason: expected 'hfo.w3c.gesture..sense' to be 'hfo.w3c.gesture.stage2.sense' // Object.is equality
