[Killed] BlockStatement
sandbox/src/smoothers/predictive-smoother.ts:51:40
 	private accelX = 0;
 	private accelY = 0;
 
-	constructor(config: PredictiveConfig) {
-		this.config = config;
-	}
+	constructor(config: PredictiveConfig) {}
 
 	smooth(frame: SensorFrame): SmoothedFrame {
killedBy: PredictiveSmoother smooth() returns prediction field
statusReason: Cannot read properties of undefined (reading 'predictionMs')

[Killed] ConditionalExpression
sandbox/src/smoothers/predictive-smoother.ts:57:7
 
 	smooth(frame: SensorFrame): SmoothedFrame {
 		// If no valid tracking, pass through with null position
-		if (!frame.trackingOk || !frame.indexTip) {
+		if (true) {
 			this.reset();
 			return SmoothedFrameSchema.parse({
killedBy: PredictiveSmoother smooth() returns prediction field
statusReason: expected null not to be null

[NoCoverage] ObjectLiteral
sandbox/src/smoothers/predictive-smoother.ts:59:37
 		// If no valid tracking, pass through with null position
 		if (!frame.trackingOk || !frame.indexTip) {
 			this.reset();
-			return SmoothedFrameSchema.parse({
-				ts: frame.ts,
-				handId: frame.handId,
-				trackingOk: false,
-				palmFacing: frame.palmFacing,
-				label: frame.label,
-				confidence: frame.confidence,
-				position: null,
-				velocity: null,
-				prediction: null,
-			});
+			return SmoothedFrameSchema.parse({});
 		}
 

[Killed] MethodExpression
sandbox/src/smoothers/predictive-smoother.ts:73:25
 		}
 
 		// Clamp position to [0,1] for schema validation
-		const x = Math.max(0, Math.min(1, frame.indexTip.x));
+		const x = Math.max(0, Math.max(1, frame.indexTip.x));
 		const y = Math.max(0, Math.min(1, frame.indexTip.y));
 
killedBy: PredictiveSmoother prediction is ahead of current position when moving
statusReason: expected 1 to be greater than 1

[Killed] MethodExpression
sandbox/src/smoothers/predictive-smoother.ts:73:13
 		}
 
 		// Clamp position to [0,1] for schema validation
-		const x = Math.max(0, Math.min(1, frame.indexTip.x));
+		const x = Math.min(0, Math.min(1, frame.indexTip.x));
 		const y = Math.max(0, Math.min(1, frame.indexTip.y));
 
killedBy: PredictiveSmoother prediction is ahead of current position when moving
statusReason: expected 0 to be greater than 0

[Survived] MethodExpression
sandbox/src/smoothers/predictive-smoother.ts:74:13
 
 		// Clamp position to [0,1] for schema validation
 		const x = Math.max(0, Math.min(1, frame.indexTip.x));
-		const y = Math.max(0, Math.min(1, frame.indexTip.y));
+		const y = Math.min(0, Math.min(1, frame.indexTip.y));
 
 		// Calculate velocity

[Survived] MethodExpression
sandbox/src/smoothers/predictive-smoother.ts:74:25
 
 		// Clamp position to [0,1] for schema validation
 		const x = Math.max(0, Math.min(1, frame.indexTip.x));
-		const y = Math.max(0, Math.min(1, frame.indexTip.y));
+		const y = Math.max(0, Math.max(1, frame.indexTip.y));
 
 		// Calculate velocity

[Killed] BlockStatement
sandbox/src/smoothers/predictive-smoother.ts:77:75
 		const y = Math.max(0, Math.min(1, frame.indexTip.y));
 
 		// Calculate velocity
-		if (this.lastX !== null && this.lastY !== null && this.lastTs !== null) {
-			let dt = (frame.ts - this.lastTs) / 1000;
-			if (dt <= 0) dt = 1 / 60;
-
-			// Raw velocity
-			const rawVelX = (x - this.lastX) / dt;
-			const rawVelY = (y - this.lastY) / dt;
-
-			// Smooth velocity with exponential moving average
-			const alpha = this.config.velocitySmoothing ?? 0.5;
-			this.velX = alpha * rawVelX + (1 - alpha) * this.velX;
-			this.velY = alpha * rawVelY + (1 - alpha) * this.velY;
-
-			// Calculate acceleration if enabled
-			if (this.config.useAcceleration) {
-				const rawAccelX = (this.velX - this.lastVelX) / dt;
-				const rawAccelY = (this.velY - this.lastVelY) / dt;
-				this.accelX = alpha * rawAccelX + (1 - alpha) * this.accelX;
-				this.accelY = alpha * rawAccelY + (1 - alpha) * this.accelY;
-			}
-
-			this.lastVelX = this.velX;
-			this.lastVelY = this.velY;
-		}
+		if (this.lastX !== null && this.lastY !== null && this.lastTs !== null) {}
 
 		// Store current values for next frame
killedBy: PredictiveSmoother prediction is ahead of current position when moving
statusReason: expected 0.4 to be greater than 0.4

[Killed] EqualityOperator
sandbox/src/smoothers/predictive-smoother.ts:77:30
 		const y = Math.max(0, Math.min(1, frame.indexTip.y));
 
 		// Calculate velocity
-		if (this.lastX !== null && this.lastY !== null && this.lastTs !== null) {
+		if (this.lastX !== null && this.lastY === null && this.lastTs !== null) {
 			let dt = (frame.ts - this.lastTs) / 1000;
 			if (dt <= 0) dt = 1 / 60;
killedBy: PredictiveSmoother prediction is ahead of current position when moving
statusReason: expected 0.4 to be greater than 0.4

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:78:14
 
 		// Calculate velocity
 		if (this.lastX !== null && this.lastY !== null && this.lastTs !== null) {
-			let dt = (frame.ts - this.lastTs) / 1000;
+			let dt = (frame.ts + this.lastTs) / 1000;
 			if (dt <= 0) dt = 1 / 60;
 

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:78:13
 
 		// Calculate velocity
 		if (this.lastX !== null && this.lastY !== null && this.lastTs !== null) {
-			let dt = (frame.ts - this.lastTs) / 1000;
+			let dt = (frame.ts - this.lastTs) * 1000;
 			if (dt <= 0) dt = 1 / 60;
 

[Survived] ConditionalExpression
sandbox/src/smoothers/predictive-smoother.ts:79:8
 		// Calculate velocity
 		if (this.lastX !== null && this.lastY !== null && this.lastTs !== null) {
 			let dt = (frame.ts - this.lastTs) / 1000;
-			if (dt <= 0) dt = 1 / 60;
+			if (false) dt = 1 / 60;
 
 			// Raw velocity

[Survived] EqualityOperator
sandbox/src/smoothers/predictive-smoother.ts:79:8
 		// Calculate velocity
 		if (this.lastX !== null && this.lastY !== null && this.lastTs !== null) {
 			let dt = (frame.ts - this.lastTs) / 1000;
-			if (dt <= 0) dt = 1 / 60;
+			if (dt > 0) dt = 1 / 60;
 
 			// Raw velocity

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:82:20
 			if (dt <= 0) dt = 1 / 60;
 
 			// Raw velocity
-			const rawVelX = (x - this.lastX) / dt;
+			const rawVelX = (x - this.lastX) * dt;
 			const rawVelY = (y - this.lastY) / dt;
 

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:82:21
 			if (dt <= 0) dt = 1 / 60;
 
 			// Raw velocity
-			const rawVelX = (x - this.lastX) / dt;
+			const rawVelX = (x + this.lastX) / dt;
 			const rawVelY = (y - this.lastY) / dt;
 

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:83:20
 
 			// Raw velocity
 			const rawVelX = (x - this.lastX) / dt;
-			const rawVelY = (y - this.lastY) / dt;
+			const rawVelY = (y - this.lastY) * dt;
 
 			// Smooth velocity with exponential moving average

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:83:21
 
 			// Raw velocity
 			const rawVelX = (x - this.lastX) / dt;
-			const rawVelY = (y - this.lastY) / dt;
+			const rawVelY = (y + this.lastY) / dt;
 
 			// Smooth velocity with exponential moving average

[Killed] LogicalOperator
sandbox/src/smoothers/predictive-smoother.ts:86:18
 			const rawVelY = (y - this.lastY) / dt;
 
 			// Smooth velocity with exponential moving average
-			const alpha = this.config.velocitySmoothing ?? 0.5;
+			const alpha = this.config.velocitySmoothing && 0.5;
 			this.velX = alpha * rawVelX + (1 - alpha) * this.velX;
 			this.velY = alpha * rawVelY + (1 - alpha) * this.velY;
killedBy: PredictiveSmoother prediction is ahead of current position when moving
statusReason: [
  {
    "code": "invalid_type",
    "expected": "number",
    "received": "nan",
    "path": [
      "velocity",
      "x"

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:87:35
 
 			// Smooth velocity with exponential moving average
 			const alpha = this.config.velocitySmoothing ?? 0.5;
-			this.velX = alpha * rawVelX + (1 - alpha) * this.velX;
+			this.velX = alpha * rawVelX + (1 + alpha) * this.velX;
 			this.velY = alpha * rawVelY + (1 - alpha) * this.velY;
 

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:87:34
 
 			// Smooth velocity with exponential moving average
 			const alpha = this.config.velocitySmoothing ?? 0.5;
-			this.velX = alpha * rawVelX + (1 - alpha) * this.velX;
+			this.velX = alpha * rawVelX + (1 - alpha) / this.velX;
 			this.velY = alpha * rawVelY + (1 - alpha) * this.velY;
 

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:88:35
 			// Smooth velocity with exponential moving average
 			const alpha = this.config.velocitySmoothing ?? 0.5;
 			this.velX = alpha * rawVelX + (1 - alpha) * this.velX;
-			this.velY = alpha * rawVelY + (1 - alpha) * this.velY;
+			this.velY = alpha * rawVelY + (1 + alpha) * this.velY;
 
 			// Calculate acceleration if enabled

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:88:34
 			// Smooth velocity with exponential moving average
 			const alpha = this.config.velocitySmoothing ?? 0.5;
 			this.velX = alpha * rawVelX + (1 - alpha) * this.velX;
-			this.velY = alpha * rawVelY + (1 - alpha) * this.velY;
+			this.velY = alpha * rawVelY + (1 - alpha) / this.velY;
 
 			// Calculate acceleration if enabled

[NoCoverage] BlockStatement
sandbox/src/smoothers/predictive-smoother.ts:91:37
 			this.velY = alpha * rawVelY + (1 - alpha) * this.velY;
 
 			// Calculate acceleration if enabled
-			if (this.config.useAcceleration) {
-				const rawAccelX = (this.velX - this.lastVelX) / dt;
-				const rawAccelY = (this.velY - this.lastVelY) / dt;
-				this.accelX = alpha * rawAccelX + (1 - alpha) * this.accelX;
-				this.accelY = alpha * rawAccelY + (1 - alpha) * this.accelY;
-			}
+			if (this.config.useAcceleration) {}
 
 			this.lastVelX = this.velX;

[Survived] ConditionalExpression
sandbox/src/smoothers/predictive-smoother.ts:91:8
 			this.velY = alpha * rawVelY + (1 - alpha) * this.velY;
 
 			// Calculate acceleration if enabled
-			if (this.config.useAcceleration) {
+			if (false) {
 				const rawAccelX = (this.velX - this.lastVelX) / dt;
 				const rawAccelY = (this.velY - this.lastVelY) / dt;

[NoCoverage] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:92:24
 
 			// Calculate acceleration if enabled
 			if (this.config.useAcceleration) {
-				const rawAccelX = (this.velX - this.lastVelX) / dt;
+				const rawAccelX = (this.velX + this.lastVelX) / dt;
 				const rawAccelY = (this.velY - this.lastVelY) / dt;
 				this.accelX = alpha * rawAccelX + (1 - alpha) * this.accelX;

[NoCoverage] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:92:23
 
 			// Calculate acceleration if enabled
 			if (this.config.useAcceleration) {
-				const rawAccelX = (this.velX - this.lastVelX) / dt;
+				const rawAccelX = (this.velX - this.lastVelX) * dt;
 				const rawAccelY = (this.velY - this.lastVelY) / dt;
 				this.accelX = alpha * rawAccelX + (1 - alpha) * this.accelX;

[NoCoverage] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:93:24
 			// Calculate acceleration if enabled
 			if (this.config.useAcceleration) {
 				const rawAccelX = (this.velX - this.lastVelX) / dt;
-				const rawAccelY = (this.velY - this.lastVelY) / dt;
+				const rawAccelY = (this.velY + this.lastVelY) / dt;
 				this.accelX = alpha * rawAccelX + (1 - alpha) * this.accelX;
 				this.accelY = alpha * rawAccelY + (1 - alpha) * this.accelY;

[NoCoverage] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:93:23
 			// Calculate acceleration if enabled
 			if (this.config.useAcceleration) {
 				const rawAccelX = (this.velX - this.lastVelX) / dt;
-				const rawAccelY = (this.velY - this.lastVelY) / dt;
+				const rawAccelY = (this.velY - this.lastVelY) * dt;
 				this.accelX = alpha * rawAccelX + (1 - alpha) * this.accelX;
 				this.accelY = alpha * rawAccelY + (1 - alpha) * this.accelY;

[NoCoverage] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:94:19
 			if (this.config.useAcceleration) {
 				const rawAccelX = (this.velX - this.lastVelX) / dt;
 				const rawAccelY = (this.velY - this.lastVelY) / dt;
-				this.accelX = alpha * rawAccelX + (1 - alpha) * this.accelX;
+				this.accelX = alpha / rawAccelX + (1 - alpha) * this.accelX;
 				this.accelY = alpha * rawAccelY + (1 - alpha) * this.accelY;
 			}

[NoCoverage] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:94:39
 			if (this.config.useAcceleration) {
 				const rawAccelX = (this.velX - this.lastVelX) / dt;
 				const rawAccelY = (this.velY - this.lastVelY) / dt;
-				this.accelX = alpha * rawAccelX + (1 - alpha) * this.accelX;
+				this.accelX = alpha * rawAccelX + (1 - alpha) / this.accelX;
 				this.accelY = alpha * rawAccelY + (1 - alpha) * this.accelY;
 			}

[NoCoverage] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:95:40
 				const rawAccelX = (this.velX - this.lastVelX) / dt;
 				const rawAccelY = (this.velY - this.lastVelY) / dt;
 				this.accelX = alpha * rawAccelX + (1 - alpha) * this.accelX;
-				this.accelY = alpha * rawAccelY + (1 - alpha) * this.accelY;
+				this.accelY = alpha * rawAccelY + (1 + alpha) * this.accelY;
 			}
 

[NoCoverage] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:95:39
 				const rawAccelX = (this.velX - this.lastVelX) / dt;
 				const rawAccelY = (this.velY - this.lastVelY) / dt;
 				this.accelX = alpha * rawAccelX + (1 - alpha) * this.accelX;
-				this.accelY = alpha * rawAccelY + (1 - alpha) * this.accelY;
+				this.accelY = alpha * rawAccelY + (1 - alpha) / this.accelY;
 			}
 

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:108:21
 		this.lastTs = frame.ts;
 
 		// Calculate prediction
-		const lookAhead = this.config.predictionMs / 1000;
+		const lookAhead = this.config.predictionMs * 1000;
 		let predX = x + this.velX * lookAhead;
 		let predY = y + this.velY * lookAhead;

[Killed] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:109:15
 
 		// Calculate prediction
 		const lookAhead = this.config.predictionMs / 1000;
-		let predX = x + this.velX * lookAhead;
+		let predX = x - this.velX * lookAhead;
 		let predY = y + this.velY * lookAhead;
 
killedBy: PredictiveSmoother prediction is ahead of current position when moving
statusReason: expected 0.35078124999999993 to be greater than 0.4

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:109:19
 
 		// Calculate prediction
 		const lookAhead = this.config.predictionMs / 1000;
-		let predX = x + this.velX * lookAhead;
+		let predX = x + this.velX / lookAhead;
 		let predY = y + this.velY * lookAhead;
 

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:110:15
 		// Calculate prediction
 		const lookAhead = this.config.predictionMs / 1000;
 		let predX = x + this.velX * lookAhead;
-		let predY = y + this.velY * lookAhead;
+		let predY = y - this.velY * lookAhead;
 
 		// Add acceleration term if physics enabled

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:110:19
 		// Calculate prediction
 		const lookAhead = this.config.predictionMs / 1000;
 		let predX = x + this.velX * lookAhead;
-		let predY = y + this.velY * lookAhead;
+		let predY = y + this.velY / lookAhead;
 
 		// Add acceleration term if physics enabled

[Survived] BlockStatement
sandbox/src/smoothers/predictive-smoother.ts:113:31
 		let predY = y + this.velY * lookAhead;
 
 		// Add acceleration term if physics enabled
-		if (this.config.usePhysics) {
-			predX += 0.5 * this.accelX * lookAhead * lookAhead;
-			predY += 0.5 * this.accelY * lookAhead * lookAhead;
-		}
+		if (this.config.usePhysics) {}
 
 		// Clamp prediction to [0,1]

[Survived] ConditionalExpression
sandbox/src/smoothers/predictive-smoother.ts:113:7
 		let predY = y + this.velY * lookAhead;
 
 		// Add acceleration term if physics enabled
-		if (this.config.usePhysics) {
+		if (false) {
 			predX += 0.5 * this.accelX * lookAhead * lookAhead;
 			predY += 0.5 * this.accelY * lookAhead * lookAhead;

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:114:13
 
 		// Add acceleration term if physics enabled
 		if (this.config.usePhysics) {
-			predX += 0.5 * this.accelX * lookAhead * lookAhead;
+			predX += 0.5 * this.accelX * lookAhead / lookAhead;
 			predY += 0.5 * this.accelY * lookAhead * lookAhead;
 		}

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:114:13
 
 		// Add acceleration term if physics enabled
 		if (this.config.usePhysics) {
-			predX += 0.5 * this.accelX * lookAhead * lookAhead;
+			predX += 0.5 / this.accelX * lookAhead * lookAhead;
 			predY += 0.5 * this.accelY * lookAhead * lookAhead;
 		}

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:115:13
 		// Add acceleration term if physics enabled
 		if (this.config.usePhysics) {
 			predX += 0.5 * this.accelX * lookAhead * lookAhead;
-			predY += 0.5 * this.accelY * lookAhead * lookAhead;
+			predY += 0.5 * this.accelY / lookAhead * lookAhead;
 		}
 

[Survived] ArithmeticOperator
sandbox/src/smoothers/predictive-smoother.ts:115:13
 		// Add acceleration term if physics enabled
 		if (this.config.usePhysics) {
 			predX += 0.5 * this.accelX * lookAhead * lookAhead;
-			predY += 0.5 * this.accelY * lookAhead * lookAhead;
+			predY += 0.5 / this.accelY * lookAhead * lookAhead;
 		}
 

[Killed] MethodExpression
sandbox/src/smoothers/predictive-smoother.ts:119:23
 		}
 
 		// Clamp prediction to [0,1]
-		predX = Math.max(0, Math.min(1, predX));
+		predX = Math.max(0, Math.max(1, predX));
 		predY = Math.max(0, Math.min(1, predY));
 
killedBy: PredictiveSmoother prediction bounds stay within 0-1 range
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "number",
    "inclusive": true,
    "exact": false,
    "message": "Number must be less than or equal to 1",

[Killed] MethodExpression
sandbox/src/smoothers/predictive-smoother.ts:119:11
 		}
 
 		// Clamp prediction to [0,1]
-		predX = Math.max(0, Math.min(1, predX));
+		predX = Math.min(0, Math.min(1, predX));
 		predY = Math.max(0, Math.min(1, predY));
 
killedBy: PredictiveSmoother prediction is ahead of current position when moving
statusReason: expected 0 to be greater than 0.4

[Survived] MethodExpression
sandbox/src/smoothers/predictive-smoother.ts:120:23
 
 		// Clamp prediction to [0,1]
 		predX = Math.max(0, Math.min(1, predX));
-		predY = Math.max(0, Math.min(1, predY));
+		predY = Math.max(0, Math.max(1, predY));
 
 		return SmoothedFrameSchema.parse({

[Survived] MethodExpression
sandbox/src/smoothers/predictive-smoother.ts:120:11
 
 		// Clamp prediction to [0,1]
 		predX = Math.max(0, Math.min(1, predX));
-		predY = Math.max(0, Math.min(1, predY));
+		predY = Math.min(0, Math.min(1, predY));
 
 		return SmoothedFrameSchema.parse({

[Killed] ObjectLiteral
sandbox/src/smoothers/predictive-smoother.ts:129:14
 			palmFacing: frame.palmFacing,
 			label: frame.label,
 			confidence: frame.confidence,
-			position: { x, y },
+			position: {},
 			velocity: { x: this.velX, y: this.velY },
 			prediction: { x: predX, y: predY },
killedBy: PredictiveSmoother smooth() returns prediction field
statusReason: [
  {
    "code": "invalid_type",
    "expected": "number",
    "received": "undefined",
    "path": [
      "position",
      "x"

[Survived] BlockStatement
sandbox/src/smoothers/predictive-smoother.ts:135:16
 		});
 	}
 
-	reset(): void {
-		this.lastX = null;
-		this.lastY = null;
-		this.lastTs = null;
-		this.velX = 0;
-		this.velY = 0;
-		this.lastVelX = 0;
-		this.lastVelY = 0;
-		this.accelX = 0;
-		this.accelY = 0;
-	}
+	reset(): void {}
 
 	setParams(params: Partial<PredictiveConfig>): void {

[NoCoverage] BlockStatement
sandbox/src/smoothers/predictive-smoother.ts:147:53
 		this.accelY = 0;
 	}
 
-	setParams(params: Partial<PredictiveConfig>): void {
-		if (params.predictionMs !== undefined) this.config.predictionMs = params.predictionMs;
-		if (params.velocitySmoothing !== undefined)
-			this.config.velocitySmoothing = params.velocitySmoothing;
-		if (params.usePhysics !== undefined) this.config.usePhysics = params.usePhysics;
-	}
+	setParams(params: Partial<PredictiveConfig>): void {}
 }
 

[NoCoverage] ConditionalExpression
sandbox/src/smoothers/predictive-smoother.ts:148:7
 	}
 
 	setParams(params: Partial<PredictiveConfig>): void {
-		if (params.predictionMs !== undefined) this.config.predictionMs = params.predictionMs;
+		if (true) this.config.predictionMs = params.predictionMs;
 		if (params.velocitySmoothing !== undefined)
 			this.config.velocitySmoothing = params.velocitySmoothing;

[NoCoverage] ConditionalExpression
sandbox/src/smoothers/predictive-smoother.ts:148:7
 	}
 
 	setParams(params: Partial<PredictiveConfig>): void {
-		if (params.predictionMs !== undefined) this.config.predictionMs = params.predictionMs;
+		if (false) this.config.predictionMs = params.predictionMs;
 		if (params.velocitySmoothing !== undefined)
 			this.config.velocitySmoothing = params.velocitySmoothing;

[NoCoverage] ConditionalExpression
sandbox/src/smoothers/predictive-smoother.ts:149:7
 
 	setParams(params: Partial<PredictiveConfig>): void {
 		if (params.predictionMs !== undefined) this.config.predictionMs = params.predictionMs;
-		if (params.velocitySmoothing !== undefined)
+		if (false)
 			this.config.velocitySmoothing = params.velocitySmoothing;
 		if (params.usePhysics !== undefined) this.config.usePhysics = params.usePhysics;

[NoCoverage] EqualityOperator
sandbox/src/smoothers/predictive-smoother.ts:149:7
 
 	setParams(params: Partial<PredictiveConfig>): void {
 		if (params.predictionMs !== undefined) this.config.predictionMs = params.predictionMs;
-		if (params.velocitySmoothing !== undefined)
+		if (params.velocitySmoothing === undefined)
 			this.config.velocitySmoothing = params.velocitySmoothing;
 		if (params.usePhysics !== undefined) this.config.usePhysics = params.usePhysics;

[NoCoverage] EqualityOperator
sandbox/src/smoothers/predictive-smoother.ts:151:7
 		if (params.predictionMs !== undefined) this.config.predictionMs = params.predictionMs;
 		if (params.velocitySmoothing !== undefined)
 			this.config.velocitySmoothing = params.velocitySmoothing;
-		if (params.usePhysics !== undefined) this.config.usePhysics = params.usePhysics;
+		if (params.usePhysics === undefined) this.config.usePhysics = params.usePhysics;
 	}
 }

[NoCoverage] ConditionalExpression
sandbox/src/smoothers/predictive-smoother.ts:151:7
 		if (params.predictionMs !== undefined) this.config.predictionMs = params.predictionMs;
 		if (params.velocitySmoothing !== undefined)
 			this.config.velocitySmoothing = params.velocitySmoothing;
-		if (params.usePhysics !== undefined) this.config.usePhysics = params.usePhysics;
+		if (false) this.config.usePhysics = params.usePhysics;
 	}
 }
