[Killed] BlockStatement
sandbox/src/smoothers/quad-cursor-pipeline.ts:59:40
 	private spring: SmootherPort | null;
 	private predictive: SmootherPort | null;
 
-	constructor(config: QuadCursorConfig) {
-		this.passthrough = new PassthroughSmootherAdapter();
-		this.euro = config.euro;
-		this.spring = config.spring;
-		this.predictive = config.predictive;
-	}
+	constructor(config: QuadCursorConfig) {}
 
 	/** Process a frame and return all 4 cursor positions */
killedBy: QuadCursorPipeline outputs 4 cursor positions per frame
statusReason: Cannot read properties of undefined (reading 'smooth')

[Killed] ObjectLiteral
sandbox/src/smoothers/quad-cursor-pipeline.ts:70:35
 	process(frame: SensorFrame): QuadCursorOutput {
 		// Raw is always available via passthrough
 		const rawFrame = this.passthrough.smooth(frame);
-		const raw = rawFrame.position ? { x: rawFrame.position.x, y: rawFrame.position.y } : null;
+		const raw = rawFrame.position ? {} : null;
 
 		// Euro (1€ filter)
killedBy: QuadCursorPipeline outputs 4 cursor positions per frame
statusReason: actual value must be number or bigint, received "undefined"

[Killed] ConditionalExpression
sandbox/src/smoothers/quad-cursor-pipeline.ts:74:7
 
 		// Euro (1€ filter)
 		let euro: { x: number; y: number } | null = null;
-		if (this.euro) {
+		if (false) {
 			const euroFrame = this.euro.smooth(frame);
 			euro = euroFrame.position ? { x: euroFrame.position.x, y: euroFrame.position.y } : null;
killedBy: QuadCursorPipeline outputs 4 cursor positions per frame
statusReason: Cannot read properties of null (reading 'x')

[Killed] BlockStatement
sandbox/src/smoothers/quad-cursor-pipeline.ts:74:18
 
 		// Euro (1€ filter)
 		let euro: { x: number; y: number } | null = null;
-		if (this.euro) {
-			const euroFrame = this.euro.smooth(frame);
-			euro = euroFrame.position ? { x: euroFrame.position.x, y: euroFrame.position.y } : null;
-		}
+		if (this.euro) {}
 
 		// Spring-damper
killedBy: QuadCursorPipeline outputs 4 cursor positions per frame
statusReason: Cannot read properties of null (reading 'x')

[Killed] ConditionalExpression
sandbox/src/smoothers/quad-cursor-pipeline.ts:81:7
 
 		// Spring-damper
 		let spring: { x: number; y: number } | null = null;
-		if (this.spring) {
+		if (true) {
 			const springFrame = this.spring.smooth(frame);
 			spring = springFrame.position
killedBy: QuadCursorPipeline each stage can be independently disabled
statusReason: Cannot read properties of null (reading 'smooth')

[Killed] ConditionalExpression
sandbox/src/smoothers/quad-cursor-pipeline.ts:81:7
 
 		// Spring-damper
 		let spring: { x: number; y: number } | null = null;
-		if (this.spring) {
+		if (false) {
 			const springFrame = this.spring.smooth(frame);
 			spring = springFrame.position
killedBy: QuadCursorPipeline outputs 4 cursor positions per frame
statusReason: Cannot read properties of null (reading 'x')

[Killed] ObjectLiteral
sandbox/src/smoothers/quad-cursor-pipeline.ts:84:7
 		if (this.spring) {
 			const springFrame = this.spring.smooth(frame);
 			spring = springFrame.position
-				? { x: springFrame.position.x, y: springFrame.position.y }
+				? {}
 				: null;
 		}
killedBy: QuadCursorPipeline outputs 4 cursor positions per frame
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
sandbox/src/smoothers/quad-cursor-pipeline.ts:90:24
 
 		// Predictive
 		let predictive: { x: number; y: number } | null = null;
-		if (this.predictive) {
-			const predFrame = this.predictive.smooth(frame);
-			predictive = predFrame.prediction
-				? { x: predFrame.prediction.x, y: predFrame.prediction.y }
-				: null;
-		}
+		if (this.predictive) {}
 
 		return {
killedBy: QuadCursorPipeline outputs 4 cursor positions per frame
statusReason: Cannot read properties of null (reading 'x')

[Killed] ConditionalExpression
sandbox/src/smoothers/quad-cursor-pipeline.ts:90:7
 
 		// Predictive
 		let predictive: { x: number; y: number } | null = null;
-		if (this.predictive) {
+		if (false) {
 			const predFrame = this.predictive.smooth(frame);
 			predictive = predFrame.prediction
killedBy: QuadCursorPipeline outputs 4 cursor positions per frame
statusReason: Cannot read properties of null (reading 'x')

[Killed] ObjectLiteral
sandbox/src/smoothers/quad-cursor-pipeline.ts:97:10
 				: null;
 		}
 
-		return {
-			raw,
-			euro,
-			spring,
-			predictive,
-			ts: frame.ts,
-		};
+		return {};
 	}
 
killedBy: QuadCursorPipeline outputs 4 cursor positions per frame
statusReason: expected undefined to be defined

[NoCoverage] BlockStatement
sandbox/src/smoothers/quad-cursor-pipeline.ts:107:16
 	}
 
 	/** Reset all smoothers */
-	reset(): void {
-		this.passthrough.reset();
-		this.euro?.reset();
-		this.spring?.reset();
-		this.predictive?.reset();
-	}
+	reset(): void {}
 }
 

[NoCoverage] OptionalChaining
sandbox/src/smoothers/quad-cursor-pipeline.ts:109:3
 	/** Reset all smoothers */
 	reset(): void {
 		this.passthrough.reset();
-		this.euro?.reset();
+		this.euro.reset();
 		this.spring?.reset();
 		this.predictive?.reset();

[NoCoverage] OptionalChaining
sandbox/src/smoothers/quad-cursor-pipeline.ts:110:3
 	reset(): void {
 		this.passthrough.reset();
 		this.euro?.reset();
-		this.spring?.reset();
+		this.spring.reset();
 		this.predictive?.reset();
 	}

[NoCoverage] OptionalChaining
sandbox/src/smoothers/quad-cursor-pipeline.ts:111:3
 		this.passthrough.reset();
 		this.euro?.reset();
 		this.spring?.reset();
-		this.predictive?.reset();
+		this.predictive.reset();
 	}
 }
