[Killed] BlockStatement
sandbox/src/smoothers/smoother-chain.ts:32:41
 export class SmootherChain implements SmootherPort {
 	private smoothers: SmootherPort[];
 
-	constructor(smoothers: SmootherPort[]) {
-		this.smoothers = [...smoothers];
-	}
+	constructor(smoothers: SmootherPort[]) {}
 
 	smooth(frame: SensorFrame): SmoothedFrame {
killedBy: SmootherChain (Composable Pipeline) chains multiple smoothers in sequence
statusReason: Cannot read properties of undefined (reading 'length')

[NoCoverage] BlockStatement
sandbox/src/smoothers/smoother-chain.ts:37:36
 	}
 
 	smooth(frame: SensorFrame): SmoothedFrame {
-		if (this.smoothers.length === 0) {
-			// Empty chain - return pass-through
-			return SmoothedFrameSchema.parse({
-				ts: frame.ts,
-				handId: frame.handId,
-				trackingOk: frame.trackingOk,
-				palmFacing: frame.palmFacing,
-				label: frame.label,
-				confidence: frame.confidence,
-				position: frame.indexTip ? { x: frame.indexTip.x, y: frame.indexTip.y } : null,
-				velocity: null,
-				prediction: null,
-			});
-		}
+		if (this.smoothers.length === 0) {}
 
 		// Run first smoother with sensor frame

[Survived] ConditionalExpression
sandbox/src/smoothers/smoother-chain.ts:37:7
 	}
 
 	smooth(frame: SensorFrame): SmoothedFrame {
-		if (this.smoothers.length === 0) {
+		if (false) {
 			// Empty chain - return pass-through
 			return SmoothedFrameSchema.parse({

[NoCoverage] ObjectLiteral
sandbox/src/smoothers/smoother-chain.ts:39:37
 	smooth(frame: SensorFrame): SmoothedFrame {
 		if (this.smoothers.length === 0) {
 			// Empty chain - return pass-through
-			return SmoothedFrameSchema.parse({
-				ts: frame.ts,
-				handId: frame.handId,
-				trackingOk: frame.trackingOk,
-				palmFacing: frame.palmFacing,
-				label: frame.label,
-				confidence: frame.confidence,
-				position: frame.indexTip ? { x: frame.indexTip.x, y: frame.indexTip.y } : null,
-				velocity: null,
-				prediction: null,
-			});
+			return SmoothedFrameSchema.parse({});
 		}
 

[Killed] UpdateOperator
sandbox/src/smoothers/smoother-chain.ts:57:46
 
 		// Chain through remaining smoothers
 		// Each smoother receives the previous output converted to SensorFrame
-		for (let i = 1; i < this.smoothers.length; i++) {
+		for (let i = 1; i < this.smoothers.length; i--) {
 			// Convert SmoothedFrame back to SensorFrame for chaining
 			const chainFrame: SensorFrame = {
killedBy: SmootherChain (Composable Pipeline) chains multiple smoothers in sequence
statusReason: [
  {
    "code": "invalid_type",
    "expected": "number",
    "received": "nan",
    "path": [
      "position",
      "x"

[Killed] EqualityOperator
sandbox/src/smoothers/smoother-chain.ts:57:19
 
 		// Chain through remaining smoothers
 		// Each smoother receives the previous output converted to SensorFrame
-		for (let i = 1; i < this.smoothers.length; i++) {
+		for (let i = 1; i <= this.smoothers.length; i++) {
 			// Convert SmoothedFrame back to SensorFrame for chaining
 			const chainFrame: SensorFrame = {
killedBy: SmootherChain (Composable Pipeline) chains multiple smoothers in sequence
statusReason: Cannot read properties of undefined (reading 'smooth')

[Killed] ObjectLiteral
sandbox/src/smoothers/smoother-chain.ts:67:8
 				label: result.label,
 				confidence: result.confidence,
 				indexTip: result.position
-					? { x: result.position.x, y: result.position.y, z: 0, visibility: 1 }
+					? {}
 					: undefined,
 			};
killedBy: SmootherChain (Composable Pipeline) chains multiple smoothers in sequence
statusReason: [
  {
    "code": "invalid_type",
    "expected": "number",
    "received": "nan",
    "path": [
      "position",
      "x"

[Killed] BlockStatement
sandbox/src/smoothers/smoother-chain.ts:77:16
 		return result;
 	}
 
-	reset(): void {
-		for (const smoother of this.smoothers) {
-			smoother.reset();
-		}
-	}
+	reset(): void {}
 
 	setParams(_params: Record<string, unknown>): void {
killedBy: SmootherChain (Composable Pipeline) reset() resets all smoothers in chain
statusReason: expected 1 to be close to 0.9, received difference is 0.09999999999999998, but expected 0.05

[Killed] BlockStatement
sandbox/src/smoothers/smoother-chain.ts:78:42
 	}
 
 	reset(): void {
-		for (const smoother of this.smoothers) {
-			smoother.reset();
-		}
+		for (const smoother of this.smoothers) {}
 	}
 
killedBy: SmootherChain (Composable Pipeline) reset() resets all smoothers in chain
statusReason: expected 1 to be close to 0.9, received difference is 0.09999999999999998, but expected 0.05

[NoCoverage] BlockStatement
sandbox/src/smoothers/smoother-chain.ts:89:44
 	}
 
 	/** Add a smoother to the end of the chain */
-	addSmoother(smoother: SmootherPort): void {
-		this.smoothers.push(smoother);
-	}
+	addSmoother(smoother: SmootherPort): void {}
 
 	/** Remove a smoother from the chain by index */

[NoCoverage] BlockStatement
sandbox/src/smoothers/smoother-chain.ts:94:38
 	}
 
 	/** Remove a smoother from the chain by index */
-	removeSmoother(index: number): void {
-		if (index >= 0 && index < this.smoothers.length) {
-			this.smoothers.splice(index, 1);
-		}
-	}
+	removeSmoother(index: number): void {}
 
 	/** Replace a smoother at a specific index */

[NoCoverage] ConditionalExpression
sandbox/src/smoothers/smoother-chain.ts:95:7
 
 	/** Remove a smoother from the chain by index */
 	removeSmoother(index: number): void {
-		if (index >= 0 && index < this.smoothers.length) {
+		if (true) {
 			this.smoothers.splice(index, 1);
 		}

[NoCoverage] ConditionalExpression
sandbox/src/smoothers/smoother-chain.ts:95:7
 
 	/** Remove a smoother from the chain by index */
 	removeSmoother(index: number): void {
-		if (index >= 0 && index < this.smoothers.length) {
+		if (true && index < this.smoothers.length) {
 			this.smoothers.splice(index, 1);
 		}

[NoCoverage] BlockStatement
sandbox/src/smoothers/smoother-chain.ts:101:63
 	}
 
 	/** Replace a smoother at a specific index */
-	replaceSmoother(index: number, smoother: SmootherPort): void {
-		if (index >= 0 && index < this.smoothers.length) {
-			this.smoothers[index] = smoother;
-		}
-	}
+	replaceSmoother(index: number, smoother: SmootherPort): void {}
 
 	/** Get the current chain length */

[NoCoverage] LogicalOperator
sandbox/src/smoothers/smoother-chain.ts:102:7
 
 	/** Replace a smoother at a specific index */
 	replaceSmoother(index: number, smoother: SmootherPort): void {
-		if (index >= 0 && index < this.smoothers.length) {
+		if (index >= 0 || index < this.smoothers.length) {
 			this.smoothers[index] = smoother;
 		}

[NoCoverage] BlockStatement
sandbox/src/smoothers/smoother-chain.ts:102:52
 
 	/** Replace a smoother at a specific index */
 	replaceSmoother(index: number, smoother: SmootherPort): void {
-		if (index >= 0 && index < this.smoothers.length) {
-			this.smoothers[index] = smoother;
-		}
+		if (index >= 0 && index < this.smoothers.length) {}
 	}
 

[NoCoverage] BlockStatement
sandbox/src/smoothers/smoother-chain.ts:108:22
 	}
 
 	/** Get the current chain length */
-	getLength(): number {
-		return this.smoothers.length;
-	}
+	getLength(): number {}
 
 	/** Get all smoothers in the chain */

[NoCoverage] BlockStatement
sandbox/src/smoothers/smoother-chain.ts:113:33
 	}
 
 	/** Get all smoothers in the chain */
-	getSmoothers(): SmootherPort[] {
-		return [...this.smoothers];
-	}
+	getSmoothers(): SmootherPort[] {}
 
 	/** Replace all smoothers in the chain (runtime swap) */

[NoCoverage] ArrayDeclaration
sandbox/src/smoothers/smoother-chain.ts:114:10
 
 	/** Get all smoothers in the chain */
 	getSmoothers(): SmootherPort[] {
-		return [...this.smoothers];
+		return [];
 	}
 

[Killed] BlockStatement
sandbox/src/smoothers/smoother-chain.ts:118:48
 	}
 
 	/** Replace all smoothers in the chain (runtime swap) */
-	setSmoothers(smoothers: SmootherPort[]): void {
-		// Reset all new smoothers to ensure clean state
-		// This prevents NaN from stale timestamps when reusing smoothers
-		for (const smoother of smoothers) {
-			smoother.reset();
-		}
-		this.smoothers = [...smoothers];
-	}
+	setSmoothers(smoothers: SmootherPort[]): void {}
 }
 
killedBy: SmootherChain (Composable Pipeline) allows runtime smoother swap
statusReason: [
  {
    "code": "invalid_type",
    "expected": "number",
    "received": "nan",
    "path": [
      "position",
      "x"

[Killed] BlockStatement
sandbox/src/smoothers/smoother-chain.ts:121:37
 	setSmoothers(smoothers: SmootherPort[]): void {
 		// Reset all new smoothers to ensure clean state
 		// This prevents NaN from stale timestamps when reusing smoothers
-		for (const smoother of smoothers) {
-			smoother.reset();
-		}
+		for (const smoother of smoothers) {}
 		this.smoothers = [...smoothers];
 	}
killedBy: SmootherChain (Composable Pipeline) allows runtime smoother swap
statusReason: [
  {
    "code": "invalid_type",
    "expected": "number",
    "received": "nan",
    "path": [
      "position",
      "x"
