[Killed] BlockStatement
sandbox/src/smoothers/one-euro-smoother.ts:38:37
  * WIRED: Wraps OneEuroAdapter with config-based construction
  */
 export class OneEuroSmoother extends OneEuroAdapter {
-	constructor(config: OneEuroConfig) {
-		super(config.mincutoff, config.beta, config.dcutoff ?? 1.0);
-	}
+	constructor(config: OneEuroConfig) {}
 }
 
killedBy: OneEuroSmoother (1€ Filter) implements SmootherPort interface
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Survived] LogicalOperator
sandbox/src/smoothers/one-euro-smoother.ts:39:40
  */
 export class OneEuroSmoother extends OneEuroAdapter {
 	constructor(config: OneEuroConfig) {
-		super(config.mincutoff, config.beta, config.dcutoff ?? 1.0);
+		super(config.mincutoff, config.beta, config.dcutoff && 1.0);
 	}
 }
